Revit 2026 API

# DocumentGetRoomAtPoint(XYZ) Method

---

Gets a room containing the point.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Room GetRoomAtPoint(
	XYZ point
)
```
```vb
Public Function GetRoomAtPoint (
	point As XYZ
) As Room
```
```cpp
public:
Room^ GetRoomAtPoint(
	XYZ^ point
)
```
```fsharp
member GetRoomAtPoint :
        point : XYZ -> Room
```

#### Parameters

point XYZ
    Point to be checked.

#### Return Value

RoomThe room containing the point.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the point is . |
| ArgumentException | Thrown when the coordinates of the point are not number or are Double::MaxValue or Double::MinValue. |

Surveys only the rooms from the final phase of the project. The first one found will be returned. If there is no room containing the point, it returns .

#### Reference

Document Class

GetRoomAtPoint Overload

Autodesk.Revit.DB Namespace